result/result.org
#+title: 新三板选股结果
#+AUTHOR: Shihao Liu
#+OPTIONS: num:t toc:nil
#+LATEX_HEADER: \setCJKmainfont{Songti SC}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \setlength\parindent{0pt}
#+LATEX_HEADER: \usepackage[font=small]{caption}
#+LATEX_HEADER: \captionsetup[table]{name=表}
#+LATEX_HEADER: \captionsetup[figure]{name=图}

#+LATEX_HEADER: \textwidth=6.6in
#+LATEX_HEADER: \textheight=8.9in
#+LATEX_HEADER: \headheight=0.0in
#+LATEX_HEADER: \oddsidemargin=0.0in
#+LATEX_HEADER: \headsep=0.0in
#+LATEX_HEADER: \topmargin=0.0in
#+LATEX_HEADER: \def\baselinestretch{1.3}

#+LATEX_HEADER: \lstset{numbers=left,
#+LATEX_HEADER:   basicstyle=\linespread{1.0}\small\ttfamily,
#+LATEX_HEADER:   numberstyle=\tiny, 
#+LATEX_HEADER:   keywordstyle= \color{blue!70},commentstyle=\color{red!50!green!50!blue!50}, 
#+LATEX_HEADER:   frame=shadowbox, 
#+LATEX_HEADER:   rulesepcolor= \color{red!20!green!20!blue!20},
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   backgroundcolor=\color[rgb]{0.91,0.91,0.91},
#+LATEX_HEADER:   framextopmargin=2pt,
#+LATEX_HEADER:   framexbottommargin=2pt,
#+LATEX_HEADER:   abovecaptionskip=-3pt,
#+LATEX_HEADER:   belowcaptionskip=3pt,
#+LATEX_HEADER:   xleftmargin=0em,
#+LATEX_HEADER:   xrightmargin=0em
#+LATEX_HEADER: } 
# Prevent showing boundaries around hyperlinks
#+LATEX_HEADER: \hypersetup{
#+LATEX_HEADER:     colorlinks,
#+LATEX_HEADER:     linkcolor={red!50!black},
#+LATEX_HEADER:     citecolor={blue!50!black},
#+LATEX_HEADER:     urlcolor={blue!80!black}
#+LATEX_HEADER: }

* Backtest results
** 选5支，逐年回测
#+CAPTION: 营业利润增长率选5支，考虑是否可交易（通过是否有做市商和成交额大小判断）

|-------------------+--------+---------------+--------------+-----------------------|
| Backtest Interval | Return | Annual Return | Max Drawdown | Max Drawdown Interval |
|-------------------+--------+---------------+--------------+-----------------------|
| 2015/6/1-2016/6/1 | 23.07% |        21.12% |       18.20% | 2015/6/1-2015/10/8    |
|                   |        |               |              |                       |
| 2016/6/1-2017/6/1 | 20.36% |        18.65% |        9.97% | 2016/6/1-2016/7/1     |
|                   |        |               |              |                       |
| 2017/6/1-2018/6/1 | 25.32% |        23.16% |        4.75% | 2018/2/1-2018/4/2     |
|                   |        |               |              |                       |
| 2015/6/1-2018/6/1 | 85.86% |        22.27% |       18.20% | 2015/6/1-2015/10/8    |
|-------------------+--------+---------------+--------------+-----------------------|


** 营业利润增长率选股，考虑是否可交易
#+ATTR_LATEX: :placement [H]
#+CAPTION: 营业利润增长率选5支，考虑是否可交易，2015/7/1 - 2018/6/1
|----------+----------+--------------+----------+--------------------+------------|
| 选股数量 | 策略收益 | 策略年化收益 | 最大回撤 | 最大回撤区间       | 收益回撤比 |
|----------+----------+--------------+----------+--------------------+------------|
|        5 |  121.16% |       30.29% |    9.67% | 2016/6/1-2016/7/1  |       3.13 |
|       10 |   70.59% |       19.49% |   14.46% | 2017/12/1-2018/4/2 |       1.34 |
|       20 |   23.23% |        7.21% |   17.87% | 2017/12/1-2018/5/2 |       0.40 |
|       50 |    1.00% |        0.33% |   18.36% | 2017/4/5-2018/6/1  |       0.01 |
|      100 |    1.13% |        0.37% |   20.14% | 2017/4/5-2018/6/1  |       0.01 |
|----------+----------+--------------+----------+--------------------+------------|

#+TBLFM: $6=$3/$4


